tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf8723_tdd.h
#define CVREN                         1091
#define PSS1BD                        1092
#define ECCP1AS_PSSBD0                1093
#define PSS1BD0                       1094
#define ECCP1AS_PSSBD1                1095
#define PSS1BD1                       1096
#define PSS1AC                        1097
#define ECCP1AS_PSSAC0                1098
#define PSS1AC0                       1099
#define ECCP1AS_PSSAC1                1100
#define PSS1AC1                       1101
#define ECCP1AS                       1102
#define ECCP1AS_ECCPAS0               1103
#define ECCP1AS0                      1104
#define ECCP1AS_ECCPAS1               1105
#define ECCP1AS1                      1106
#define ECCP1AS_ECCPAS2               1107
#define ECCP1AS2                      1108
#define ECCP1ASE                      1109
#define ECCP1AS_ECCPASE               1110
#define CCP3CON                       1111
#define CCP3M                         1112
#define CCP3M0                        1113
#define CCP3M1                        1114
#define CCP3M2                        1115
#define CCP3M3                        1116
#define CCP3Y                         1117
#define DC3B                          1118
#define DC3B0                         1119
#define DC3B1                         1120
#define CCP3X                         1121
#define P3M                           1122
#define P3M0                          1123
#define P3M1                          1124
#define CCP2CON                       1125
#define CCP2M                         1126
#define CCP2M0                        1127
#define CCP2M1                        1128
#define CCP2M2                        1129
#define CCP2M3                        1130
#define DC2B                          1131
#define DC2B0                         1132
#define CCP2Y                         1133
#define DC2B1                         1134
#define CCP2X                         1135
#define P2M                           1136
#define P2M0                          1137
#define P2M1                          1138
#define CCP1CON                       1139
#define CCP1M0                        1140
#define CCP1M                         1141
#define CCP1M1                        1142
#define CCP1M2                        1143
#define CCP1M3                        1144
#define CCP1Y                         1145
#define DC1B                          1146
#define DC1B0                         1147
#define CCP1X                         1148
#define DC1B1                         1149
#define P1M                           1150
#define P1M0                          1151
#define P1M1                          1152
#define ADCON2                        1153
#define ADCS0                         1154
#define ADCS                          1155
#define ADCS1                         1156
#define ADCS2                         1157
#define ACQT0                         1158
#define ACQT                          1159
#define ACQT1                         1160
#define ACQT2                         1161
#define ADFM                          1162
#define ADCON1                        1163
#define PCFG0                         1164
#define PCFG                          1165
#define PCFG1                         1166
#define PCFG2                         1167
#define CHSN3                         1168
#define PCFG3                         1169
#define VCFG                          1170
#define VCFG0                         1171
#define VCFG01                        1172
#define VCFG11                        1173
#define VCFG1                         1174
#define ADCON0                        1175
#define ADON                          1176
#define nDONE                         1177
#define GO_nDONE                      1178
#define NOT_DONE                      1179
#define GODONE                        1180
#define GO_DONE                       1181
#define DONE                          1182
#define GO                            1183
#define GO_NOT_DONE                   1184
#define CHS                           1185
#define CHS0                          1186
#define CHS1                          1187
#define CHS2                          1188
#define CHS3                          1189
#define SSP1CON2                      1190
#define SEN1                          1191
#define SSP1CON2_SEN                  1192
#define ADMSK11                       1193
#define SSP1CON2_RSEN                 1194
#define RSEN1                         1195
#define ADMSK1                        1196
#define SSP1CON2_PEN                  1197
#define ADMSK21                       1198
#define PEN1                          1199
#define ADMSK2                        1200
#define ADMSK31                       1201
#define RCEN1                         1202
#define SSP1CON2_RCEN                 1203
#define ADMSK3                        1204
#define SSP1CON2_ACKEN                1205
#define ACKEN1                        1206
#define ADMSK41                       1207
#define ADMSK4                        1208
#define ACKDT1                        1209
#define ADMSK51                       1210
#define SSP1CON2_ACKDT                1211
#define ADMSK5                        1212
#define SSP1CON2_ACKSTAT              1213
#define ACKSTAT1                      1214
#define GCEN1                         1215
#define SSP1CON2_GCEN                 1216
#define SSP1CON1                      1217
#define SSP1CON1_SSPM0                1218
#define SSPM01                        1219
#define SSP1CON1_SSPM                 1220
#define SSP1CON1_SSPM1                1221
#define SSPM11                        1222
#define SSP1CON1_SSPM2                1223
#define SSPM21                        1224
#define SSPM31                        1225
#define SSP1CON1_SSPM3                1226
#define SSP1CON1_CKP                  1227
#define CKP1                          1228
#define SSPEN1                        1229
#define SSP1CON1_SSPEN                1230
#define SSPOV1                        1231
#define SSP1CON1_SSPOV                1232
#define WCOL1                         1233
#define SSP1CON1_WCOL                 1234
#define SSP1STAT                      1235
#define BF1                           1236
#define SSP1STAT_BF                   1237
#define UA1                           1238
#define SSP1STAT_UA                   1239
#define SSP1STAT_R_NOT_W              1240
#define RW1                           1241
#define NOT_W                         1242
#define SSP1STAT_R                    1243
#define SSP1STAT_nW                   1244
#define RW                            1245
#define SSP1STAT_READ_WRITE           1246
#define SSP1STAT_nWRITE               1247
#define SSP1STAT_I2C_READ             1248
#define SSP1STAT_R_W                  1249
#define SSP1STAT_NOT_WRITE            1250
#define SSP1STAT_R_nW                 1251
#define SSP1STAT_S                    1252
#define START                         1253
#define START1                        1254
#define SSP1STAT_I2C_START            1255
#define STOP                          1256
#define SSP1STAT_P                    1257
#define STOP1                         1258
#define SSP1STAT_I2C_STOP             1259
#define SSP1STAT_D                    1260
#define SSP1STAT_D_NOT_A              1261
#define NOT_A                         1262
#define SSP1STAT_D_A                  1263
#define SSP1STAT_D_nA                 1264
#define SSP1STAT_NOT_ADDRESS          1265
#define SSP1STAT_nA                   1266
#define DA1                           1267
#define DA                            1268
#define SSP1STAT_nADDRESS             1269
#define SSP1STAT_I2C_DAT              1270
#define SSP1STAT_DATA_ADDRESS         1271
#define SSP1STAT_CKE                  1272
#define CKE1                          1273
#define SSP1STAT_SMP                  1274
#define SMP1                          1275
#define SSP1ADD                       1276
#define MSK01                         1277
#define MSK0                          1278
#define MSK11                         1279
#define MSK1                          1280
#define MSK21                         1281
#define MSK2                          1282
#define MSK3                          1283
#define MSK31                         1284
#define MSK4                          1285
#define MSK41                         1286
#define MSK51                         1287
#define MSK5                          1288
#define MSK61                         1289
#define MSK6                          1290
#define MSK71                         1291
#define MSK7                          1292
#define T2CON                         1293
#define T2CKPS0                       1294
#define T2CKPS                        1295
#define T2CKPS1                       1296
#define TMR2ON                        1297
#define T2OUTPS0                      1298
#define T2CON_TOUTPS                  1299
#define T2OUTPS1                      1300
#define T2OUTPS2                      1301
#define T2OUTPS3                      1302
#define T1CON                         1303
#define TMR1ON                        1304
#define TMR1CS                        1305
#define NOT_T1SYNC                    1306
#define T1SYNC                        1307
#define nT1SYNC                       1308
#define T1INSYNC                      1309
#define T1OSCEN                       1310
#define SOSCEN                        1311
#define T1CKPS0                       1312
#define T1CKPS                        1313
#define T1CKPS1                       1314
#define T1RUN                         1315
#define T1RD16                        1316
#define T1CON_RD16                    1317
#define RCON                          1318
#define BOR                           1319
#define NOT_BOR                       1320
#define nBOR                          1321
#define POR                           1322
#define nPOR                          1323
#define NOT_POR                       1324
#define PD                            1325
#define nPD                           1326
#define NOT_PD                        1327
#define NOT_TO                        1328
#define nTO                           1329
#define TO                            1330
#define nRI                           1331
#define NOT_RI                        1332
#define RI                            1333
#define SBOREN                        1334
#define IPEN                          1335
#define WDTCON                        1336
#define SWDTE                         1337
#define SWDTEN                        1338
#define HLVDCON                       1339
#define HLVDL                         1340
#define HLVDL0                        1341
#define LVV0                          1342
#define LVDL0                         1343
#define HLVDL1                        1344
#define LVDL1                         1345
#define LVV1                          1346
#define HLVDL2                        1347
#define LVV2                          1348
#define LVDL2                         1349
#define HLVDL3                        1350
#define LVV3                          1351
#define LVDL3                         1352
#define HLVDEN                        1353
#define LVDEN                         1354
#define BGST                          1355
#define IRVST                         1356
#define IVRST                         1357
#define VDIRMAG                       1358
#define OSCCON                        1359
#define SCS0                          1360
#define SCS                           1361
#define SCS1                          1362
#define FLTS                          1363
#define IOFS                          1364
#define OSTS                          1365
#define IRCF                          1366
#define IRCF0                         1367
#define IRCF1                         1368
#define IRCF2                         1369
#define IDLEN                         1370
#define T0CON                         1371
#define T0PS                          1372
#define T0PS0                         1373
#define T0PS1                         1374
#define T0PS2                         1375
#define PSA                           1376
#define T0PS3                         1377
#define T0SE                          1378
#define T0CS                          1379
#define T08BIT                        1380
#define TMR0ON                        1381
#define STATUS                        1382
#define C                             1383
#define CARRY                         1384
#define DC                            1385
#define ZERO                          1386
#define Z                             1387
#define OV                            1388
#define OVERFLOW                      1389
#define N                             1390
#define NEGATIVE                      1391
#define INTCON3                       1392
#define INT1IF                        1393
#define INT1F                         1394
#define INT2IF                        1395
#define INT2F                         1396
#define INT3F                         1397
#define INT3IF                        1398
#define INT1E                         1399
#define INT1IE                        1400
#define INT2IE                        1401
#define INT2E                         1402
#define INT3E                         1403
#define INT3IE                        1404
#define INT1P                         1405
#define INT1IP                        1406
#define INT2IP                        1407
#define INT2P                         1408
#define INTCON2                       1409
#define RBIP                          1410
#define INT3IP                        1411
#define INT3P                         1412
#define TMR0IP                        1413
#define T0IP                          1414
#define INTEDG3                       1415
#define INTEDG2                       1416
#define INTEDG1                       1417
#define INTEDG0                       1418
#define RBPU                          1419
#define NOT_RBPU                      1420
#define nRBPU                         1421
#define INTCON                        1422
#define RBIF                          1423
#define INT0F                         1424
#define INT0IF                        1425
#define T0IF                          1426
#define TMR0IF                        1427
#define RBIE                          1428
#define INT0E                         1429
#define INT0IE                        1430
#define T0IE                          1431
#define TMR0IE                        1432
#define PEIE                          1433
#define PEIE_GIEL                     1434
#define GIEL                          1435
#define GIE_GIEH                      1436
#define GIE                           1437
#define GIEH                          1438
#define STKPTR0                       1439
#define STKPTR                        1440
#define SP0                           1441
#define STKPTR1                       1442
#define SP1                           1443
#define STKPTR2                       1444
#define SP2                           1445
#define SP3                           1446
#define STKPTR3                       1447
#define STKPTR4                       1448
#define SP4                           1449
#define STKUNF                        1450
#define STKOVF                        1451
#define STKFUL                        1452

#endif // _PIC18LF8723_H_
